index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-21 Wed 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FedEx vs UPS: Case Notes and Questions</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">FedEx vs UPS: Case Notes and Questions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4359fa3">1. Concepts to Review/Highlight:</a>
<ul>
<li><a href="#orgd5149e1">1.1. Financial Ratios</a></li>
<li><a href="#org1b35f87">1.2. Net Operating Profit After Tax (NOPAT)</a></li>
<li><a href="#org388429e">1.3. Economic Value Added (EVA)</a></li>
<li><a href="#orga8c40b5">1.4. WACC</a>
<ul>
<li><a href="#org9a56dfc">1.4.1. Cost of Debt</a></li>
<li><a href="#orgab1145f">1.4.2. Cost of Equity</a></li>
<li><a href="#orgea84e89">1.4.3. Putting it together to calculate the WACC</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7da39f0">2. Internal and Sustainable Growth Rates</a></li>
<li><a href="#org1fbf657">3. Case and Discussion Questions</a></li>
<li><a href="#org7fa0964">4. Other Notes</a></li>
<li><a href="#orgaad89e2">5. Relevant Lecture Notes</a></li>
<li><a href="#org30e6f0b">6. Pecking Order Theory (Capital Structure)</a></li>
<li><a href="#org9b5d63b">7. Comparing stock performance</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4359fa3" class="outline-2">
<h2 id="org4359fa3"><span class="section-number-2">1.</span> Concepts to Review/Highlight:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd5149e1" class="outline-3">
<h3 id="orgd5149e1"><span class="section-number-3">1.1.</span> Financial Ratios</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Financial ratio values can be volatile. Don't pick out one ratio for one particular year and draw conclusions from it&#x2014;it could be due to particular charges unique to that year.  Instead, look at the trend in the ratio over time and its relation over time to the same ratio at a similar firm.</li>

<li>Know what are good values of a particular ratio.</li>

<li>Many different ratios measure the same thing, so don't spend time analyzing each.  For example, we can see that Fedex's debt to equity ratio is declining.  Given this we would <b>expect</b> its Time-Interest-Earned ratio to increase, which it does.  So there is no need to discuss both ratios.  It is possible, though rare, that the Time-Interest-Earned ratio may not increase.  If this were the case then discussing why would be relevant.</li>

<li>Each financial ratio is intended to measure a particular aspect of the firm's performance.  Be sure to know what each ratio is measuring.</li>
</ol>

<p>
Question: which ration are least important?
</p>
</div>
</div>


<div id="outline-container-org1b35f87" class="outline-3">
<h3 id="org1b35f87"><span class="section-number-3">1.2.</span> Net Operating Profit After Tax (NOPAT)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Measures such as NOPAT and Earnings Before Interest and Taxes (EBIT) attempt to estimate a firm's cash flow.
</p>
</div>
</div>

<div id="outline-container-org388429e" class="outline-3">
<h3 id="org388429e"><span class="section-number-3">1.3.</span> Economic Value Added (EVA)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
EVA is a method of measuring corporate performance that is used in many prominent firms such as AT&amp;T , Coca-Cola, and Toyota.  The idea is to compare cash flow the firm generates to the payments the firm must make to debt and equity holders (WACC times capital).
</p>

<p>
\[RONA * Capital - WACC * Capital \approx Cash\ Flow\ Generated - Cost\ of\ Capital\ in\ Dollars\]
</p>

<p>
Ideally these should be market values, however we often must work with accounting values.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffc777;">int</span>
<span style="color: #82aaff;">main</span>(){
  <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">NOPAT</span> = 1448;
  <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">Capital</span> = 9679; <span style="color: #7a88cf;">/*</span><span style="color: #7a88cf;">Capital employed in the business or operation, how does this differ from total assets?</span><span style="color: #7a88cf;">*/</span>
  <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">RONA</span> = NOPAT / Capital; <span style="color: #7a88cf;">//</span><span style="color: #7a88cf;">return on net assets</span>
  <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">WACC</span> = 0.1272;
  <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">EVA</span> = (RONA - WACC) * Capital;
  printf(<span style="color: #c3e88d;">"The Economic Value Added is $%.2f\n"</span>, EVA);
  <span style="color: #c099ff;">return</span> 0;
}
</pre>
</div>

<pre class="example">
The Economic Value Added is $216.83
</pre>
</div>
</div>

<div id="outline-container-orga8c40b5" class="outline-3">
<h3 id="orga8c40b5"><span class="section-number-3">1.4.</span> WACC</h3>
<div class="outline-text-3" id="text-1-4">
<p>
\(WACC = w_e r_e + w_d r_d (1 - \tau)\)
</p>

<p>
where \(w_e\) and \(w_d\) is the weight of equity and debt, respectively in the capital structure.  \(r_e\) and \(r_d\) are the required returns on equity and debt, and \(\tau\) is the tax rate.
</p>
</div>

<div id="outline-container-org9a56dfc" class="outline-4">
<h4 id="org9a56dfc"><span class="section-number-4">1.4.1.</span> Cost of Debt</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
We get the cost of debt by observing the yield-to-maturity on the firm's outstanding debt.  If the debt is not traded, we may have to find similar debt that is traded.  
</p>
</div>
</div>

<div id="outline-container-orgab1145f" class="outline-4">
<h4 id="orgab1145f"><span class="section-number-4">1.4.2.</span> Cost of Equity</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
We can get \(r_e\) from the CAPM: \(r_e = r_f + \beta_e (r_m - r_f)\)  Using a python class and method to calculate the return on equity.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">class</span> <span style="color: #ffc777;">CAPMdata</span>:
     <span style="color: #9ba5db;">"""a data structure to hold capm data"""</span>
     <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span>(<span style="color: #c099ff;">self</span>, risk_free, beta, return_market):
         <span style="color: #c099ff;">self</span>.rf = risk_free
         <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">b</span> = beta
         <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">rm</span> = return_market

     <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">capm</span>(<span style="color: #c099ff;">self</span>):
         <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">self</span>.rf + <span style="color: #c099ff;">self</span>.b * (<span style="color: #c099ff;">self</span>.rm - <span style="color: #c099ff;">self</span>.rf)

<span style="color: #c099ff;">print</span>(<span style="color: #c3e88d;">"This required return on equity is {0:.2%}"</span>.<span style="color: #c099ff;">format</span>(CAPMdata(.03, 1.5, .08).capm()))
</pre>
</div>

<pre class="example">
This required return on equity is 10.50%
</pre>
</div>
</div>

<div id="outline-container-orgea84e89" class="outline-4">
<h4 id="orgea84e89"><span class="section-number-4">1.4.3.</span> Putting it together to calculate the WACC</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffc777;">double</span> <span style="color: #82aaff;">capm</span>(<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">rf</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">beta</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">rm</span>){
<span style="color: #c099ff;">return</span> rf + beta * (rm - rf);
}

<span style="color: #ffc777;">double</span> <span style="color: #82aaff;">wacc</span>(<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">wd</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">we</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">re</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">rd</span>, <span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">tax</span>){
<span style="color: #c099ff;">return</span> we * re + wd * rd * (1 - tax);
}

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span>(){

<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">wd</span> = .4;
<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">rd</span> = .05;
<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">we</span> = 1 - wd;
<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">re</span> = capm(.02, 1.5, .08);
<span style="color: #ffc777;">double</span> <span style="color: #ff98a4;">tax</span> = .4;

  printf(<span style="color: #c3e88d;">"The WACC is %.2f\%\n"</span>, 100 * wacc(wd, we, rd, re, tax));
}

</pre>
</div>

<pre class="example">
The WACC is 5.64%
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7da39f0" class="outline-2">
<h2 id="org7da39f0"><span class="section-number-2">2.</span> Internal and Sustainable Growth Rates</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://financial-education.github.io/growth_rates_and_EFN/">See here.</a>  May help answer which firm is in the best financial position to expand.
</p>
</div>
</div>

<div id="outline-container-org1fbf657" class="outline-2">
<h2 id="org1fbf657"><span class="section-number-2">3.</span> Case and Discussion Questions</h2>
<div class="outline-text-2" id="text-3">
<p>
<b><b>Which firm is in the best financial position to expand (buy assets) (win the routes to China)?</b></b>
</p>

<p>
Secondary: 
</p>

<ol class="org-ol">
<li>Have FedEx and UPS achieved their stated goals?
<ul class="org-ul">
<li>Fedex's goal: "superior financial returns".</li>
<li>UPS's goal: "long-term competitive return".</li>
</ul></li>
<li>Can strong performance be expected in the future?</li>
<li>What has been the effect of the intense competition between the firms?</li>
<li>Which firm would you say is performing "better", and how might we define better?</li>
</ol>
</div>
</div>

<div id="outline-container-org7fa0964" class="outline-2">
<h2 id="org7fa0964"><span class="section-number-2">4.</span> Other Notes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>pg 53 "the stock price of both companies had been rising steadily since those talks began&#x2026;" this is a good example of the type of information you should know if you are going to speculate in the stock market.</li>
<li>Fedex had a larger presence in China&#x2014;was this noticeable in the stock prices?  100 new weekly cargo flights were to be divided between FedExand UPS.</li>
<li>UPS stock was listed on the NYSE in 1999, used the stock to increase acquisitions (page 57).</li>
<li>pg 59, Capex increases at an annual rate of 35% and 37% for UPS and Fedex respectively.  Also see exhibit 6 page 68.</li>
<li>Air cargo market in China growing at 30% per year. Focus on export/import ($1 billion). Middle page 60.</li>
</ul>
</div>
</div>


<div id="outline-container-orgaad89e2" class="outline-2">
<h2 id="orgaad89e2"><span class="section-number-2">5.</span> Relevant Lecture Notes</h2>
<div class="outline-text-2" id="text-5">
<p>
See <a href="https://financial-education.github.io/intro_corp_fin.html">lecture notes here</a> on (at least) financial ratios and the cost of capital.
</p>
</div>
</div>


<div id="outline-container-org30e6f0b" class="outline-2">
<h2 id="org30e6f0b"><span class="section-number-2">6.</span> Pecking Order Theory (Capital Structure)</h2>
<div class="outline-text-2" id="text-6">
<p>
Financing from cheapest to most expensive
</p>

<ol class="org-ol">
<li>Retained earnings (NOPAT)</li>
<li>Debt</li>
<li>Equity</li>
</ol>

<p>
So when you are thinking about which company is in a better position to expand its assets, you can think about these sources of financing.
</p>

<ol class="org-ol">
<li>Which has greater NOPAT/EVA?</li>
<li>Which has 'better' long-term debt ratios (higher TIE or lower D/E or EM)?</li>
<li>How do we measure the ability to issue new equity?
<ul class="org-ul">
<li>New Equity decreases EPS and raises P/E.</li>
<li>Cost of equity? See this article: <a href="https://hbr.org/2012/07/do-you-know-your-cost-of-capital">https://hbr.org/2012/07/do-you-know-your-cost-of-capital</a></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org9b5d63b" class="outline-2">
<h2 id="org9b5d63b"><span class="section-number-2">7.</span> Comparing stock performance</h2>
<div class="outline-text-2" id="text-7">
<p>
Using the provided stock prices:
</p>
<ul class="org-ul">
<li>You can calculate annual returns and then use a t0test for significantly different mean returns.</li>
<li>Calculate Sharpe Ratios.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-09-21 Wed 16:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
